# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12-Extreme-Ghost

# Parameters
nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, GhostConv, [64, 3, 2]] # 0-P1/2 (Conv -> GhostConv)
  - [-1, 1, GhostConv, [128, 3, 2, 1, 2]] # 1-P2/4 (Conv -> GhostConv)
  - [-1, 2, C3Ghost, [256, False, 1, 0.25]] # 2 (C3k2 -> C3Ghost with g=1)
  - [-1, 1, GhostConv, [256, 3, 2, 1, 4]] # 3-P3/8 (Conv -> GhostConv)
  - [-1, 2, C3Ghost, [512, False, 1, 0.25]] # 4 (C3k2 -> C3Ghost with g=1)
  - [-1, 1, GhostConv, [512, 3, 2]] # 5-P4/16 (Conv -> GhostConv)
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, GhostConv, [1024, 3, 2]] # 7-P5/32 (Conv -> GhostConv)
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, GhostConv, [256, 3, 2]] # 15 (Conv -> GhostConv)
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, GhostConv, [512, 3, 2]] # 18 (Conv -> GhostConv)
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [1024, True]] # 20 (C3k2 -> C3Ghost)

  - [[14, 17, 20], 1, Detect, [nc]]
